In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
%matplotlib inline

In [2]:
df=pd.read_csv('hiring.txt')

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
#we can see that features experience has nan and test score has nan
#experience with 0
#test score be median

In [8]:
test_score_meadian=df['test_score(out of 10)'].median()
test_score_meadian

8.0

In [10]:
df.fillna({'experience':'zero','test_score(out of 10)':test_score_meadian},inplace=True)

In [11]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

#using a library to convert strings to numericals
#word2number
!pip install word2number

In [14]:
from word2number import w2n

In [15]:
w2n.word_to_num('two')

2

In [16]:
w2n.word_to_num('fifty five')

55

In [18]:
w2n.word_to_num('two point five')

2.5

In [19]:
#we should apply this to the experience column
df['experience']=df['experience'].apply(lambda x:w2n.word_to_num(x))

In [20]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

Now we have preprocessed our data

In [21]:
X=df.drop('salary($)',axis=1)

In [22]:
y=df['salary($)']

In [26]:
reg=linear_model.LinearRegression()

In [27]:
#training the model
reg.fit(X,y)

LinearRegression()

Checking for the coefficients

In [28]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [29]:
reg.intercept_

17737.263464337688

* 2 yr experience,9 test score,6 interview score
* 12 year experience,10 test score.10 interview score

In [31]:
salary1=reg.predict([[2,9,6]])[0]
salary1

53205.96797671033

In [33]:
salary2=reg.predict([[12,10,10]])
salary2

array([92002.18340611])